Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: འདུ་བྱེད་ཀྱི་དངོས་པོ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་དངོས་པོ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པའི་དངོས་པོ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བའི་དངོས་པོ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous kinds of knowledge of existents concerning the composite, the inconceivably numerous kinds of knowledge of existents concerning teaching the composite, the inconceivably numerous kinds of knowledge of existents concerning the kleśas, and the inconceivably numerous kinds of knowledge of existents concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གང་ཟག་ཤེས་པ་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: “Young man, the bodhisattvas have four kinds of knowledge of the individual. What are the four kinds of knowledge of the individual?

source: འདུ་བྱེད་ཀྱི་གང་ཟག་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་གང་ཟག་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པའི་གང་ཟག་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བའི་གང་ཟག་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous kinds of knowledge of the individual concerning the composite, the inconceivably numerous kinds of knowledge of the individual concerning teaching the composite, the inconceivably numerous kinds of knowledge of the individual concerning the kleśas, and the inconceivably numerous kinds of knowledge of the individual concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་དམིགས་པ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་བསམ་གྱིས་མི་ཁྱབ་པར་བསྟན་པ་བཞི་སྟེ། མཐར་ཕྱིན་པའི་གནས་སུ་བསྟན་པར་སླ་བ་མ་ཡིན་ནོ། །བཞི་གང་ཞེ་ན།
en: “Young man, the bodhisattvas have four kinds of knowledge of apprehensions. What are the four kinds of knowledge of apprehensions?

source: འདུ་བྱེད་ཀྱི་དམིགས་པ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་དམིགས་པ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པའི་དམིགས་པ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བའི་དམིགས་པ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དམིགས་པ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་བསམ་གྱིས་མི་ཁྱབ་པར་བསྟན་པ་བཞི་སྟེ།
en: They are the inconceivably numerous kinds of knowledge of apprehensions concerning the composite, the inconceivably numerous kinds of knowledge of apprehensions concerning teaching the composite, the inconceivably numerous kinds of knowledge of apprehensions concerning the kleśas, and the inconceivably numerous kinds of knowledge of apprehensions concerning purification. Those are the four. “Young man, those are the four inconceivably numerous kinds of knowledge of apprehensions that are taught to be inconceivably numerous.

source: དེ་དག་ནི་མཐར་ཕྱིན་པའི་གནས་སུ་བསྟན་པར་སླ་བ་མ་ཡིན་ནོ། །གཟུངས་བཞི་སྟེ།
en: It is not easy to state an end to them. “Young man, the bodhisattvas have four kinds of retention.

source: འདུ་བྱེད་ཐམས་ཅད་མཐའ་ཡས་པར་བཤད་པ་བརྗོད་པ་དེ་ལ་གང་ཤེས་པ་འདི་ནི་གཟུངས་དང་པོའོ།
en: The first retention is of what is known concerning the teaching of all infinite composites.

source: །དབྱངས་མཐའ་ཡས་པར་བཤད་པ་བརྗོད་པ་དེ་ལ་གང་ཤེས་པ་འདི་ནི་གཟུངས་གཉིས་པའོ།
en: The second retention is of what is known concerning the teaching of all infinite sounds.

source: །ཀུན་ནས་ཉོན་མོངས་པ་མཐའ་ཡས་པར་བཤད་པ་བརྗོད་པ་དེ་ལ་གང་ཤེས་པ་འདི་ནི་གཟུངས་གསུམ་པའོ།
en: The third retention is of what is known concerning the teaching of all infinite kleśas.

source: །རྣམ་པར་བྱང་བའི་ཡོན་ཏན་གྱིས་ཕན་ཡོན་མཐའ་ཡས་པར་བཤད་པ་བརྗོད་པ་དེ་ལ་གང་ཤེས་པ་འདི་ནི་གཟུངས་བཞི་པ་སྟེ།
en: The fourth retention is of what is known concerning the teaching of all infinite purifications.

source: གཟུངས་བཞི་པོ་ནི་འདི་དག་གོ།
en: Those are the four retentions.

source: །གཞོན་ནུ་འདི་ལྟར་གཟུངས་གང་ཡིན་པ་དེ་ནི་ཤེས་པའོ།
en: The four retentions are those.

source: །དེ་ནི་ཆོས་སོ། །འདི་ལྟར་ཆོས་ཤེས་པས་ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པའོ།
en: “So it is in these ways that there is the discernment of phenomena through knowing phenomena.

source: །ཆོས་ཤེས་པ་ལ་དོན་གང་ཡིན་པ་དེ་ནི་དོན་སོ་སོ་ཡང་དག་པར་རིག་པ་ཞེས་བྱའོ།
en: “The discernment of meaning is the meaning in the knowledge of phenomena.

source: །ཆོས་ཤེས་པ་ལ་འདུན་པ་གང་ཡིན་པ་དེ་ནི་ངེས་པའི་ཚིག་སོ་སོ་ཡང་དག་པར་རིག་པ་ཞེས་བྱའོ།
en: “The discernment of definitions is delight in the knowledge of phenomena.

source: །ཆོས་ཤེས་པ་ལ་ཐ་སྙད་དུ་སྟོན་པ་དང་འཆད་པ་དང་འདོགས་པ་དང་རབ་ཏུ་སྟོན་པ་དང་རབ་ཏུ་འགོད་པ་དང་འབྱེད་པ་དང་རྣམ་པར་འབྱེད་པ་དང་གསལ་བར་བྱེད་པ་དང་ཚིག་ཐོགས་པ་མེད་པ་དང་ཚིག་མི་འདོར་ཞིང་མ་ལྐུགས་མི་དིག་པ་དང་། ཚིག་ཞུམ་པ་མེད་པ་འདི་ནི་གཞོན་ནུ་སྤོབས་པ་སོ་སོ་ཡང་དག་པར་རིག་པ་ཞེས་བྱའོ།
en: “Young man, the discernment of eloquence is teaching terminology, explaining, expounding, clarifying, disseminating, analyzing, differentiating, proclaiming, having unimpeded speech, having unalloyed speech, not being mute, not stammering, and speaking without loss of confidence in relation to the knowledge of phenomena.”

source: །སངས་རྒྱས་ཡེ་ཤེས་ཇི་སྙེད་པ།
en: “As numerous as are the knowledges of the Buddha,

source: །གཟུགས་སུ་བརྟགས་པའང་དེ་སྙེད་དེ།
en: There are that many designations for forms.

source: །གཟུགས་སུ་བརྟགས་པ་ཇི་སྙེད་པ།
en: As numerous as are the designations for forms,

source: །གཟུགས་སུ་བརྗོད་པ་འང་དེ་སྙེད་དོ།
en: There are that many appellations of forms. {1}

source: །གཟུགས་སུ་བརྗོད་པ་ཇི་སྙེད་པ།
en: “As numerous as are the appellations of forms,

source: །ཚུལ་ཁྲིམས་མིང་ཡང་དེ་སྙེད་དོ།
en: There are that many names for conduct.

source: །ཚུལ་ཁྲིམས་མིང་ཡང་ཇི་སྙེད་པ།
en: As numerous as are the names for conduct,

source: །སངས་རྒྱས་མིང་ཡང་དེ་སྙེད་དོ།
en: There are that many names of buddhas. {2}

source: །སངས་རྒྱས་མིང་ནི་ཇི་སྙེད་པ། །སེམས་ཅན་མིང་ཡང་དེ་སྙེད་དོ།
en: “As numerous as are the names of buddhas, There are that many names of beings. I know whatever number of names Even one single being has. {3} “The names for conduct, names of buddhas,

source: །སེམས་ཅན་གཅིག་གི་མིང་ཡང་ནི། །དེ་སྙེད་དུ་ནི་ངས་བཤད་དོ།
en: And names of beings are equal

source: །མིང་དང་བརྗོད་པ་མཐའ་ཡས་པ།
en: To the infinity of names and appellations

source: །གང་དག་ངས་ནི་སྔར་བཤད་རྣམས། །ཚུལ་ཁྲིམས་མིང་དང་སངས་རྒྱས་མིང་། །སེམས་ཅན་མིང་དང་དེ་དག་མཚུངས།
en: That I have previously taught. {4}

source: །འདུས་བྱས་ཉེས་པ་ཇི་སྙེད་པ།
en: “As numerous as are the faults in the composite,

source: །མྱ་ངན་འདས་བསྔགས་དེ་སྙེད་དེ།
en: There are that many qualities in nirvāṇa.

source: །སངས་རྒྱས་ཀྱི་ནི་བསྔགས་པ་དང་། །དཔེ་ཡང་དེ་སྙེད་ངས་བཤད་དོ།
en: I have taught as many analogies As there are qualities of the buddhas. {5}

source: །ཇི་སྙེད་སེམས་ཅན་ཐམས་ཅད་ཀྱི།
en: “As numerous as are the motivations

source: །སེམས་རྣམས་སྐྱེ་བ་ངེས་བསྟན་པ།
en: That I have taught beings to have,

source: །འཇིག་རྟེན་མགོན་པོའི་སྤུ་གཅིག་ནས། །འོད་ཟེར་དག་ཀྱང་དེ་སྙེད་འབྱུང་།
en: There are that many light rays From a single hair of a Lord of the World. {6}

source: །སེམས་ཅན་ཀུན་གྱི་མོས་པ་དང་། །མིང་རྣམས་ཇི་སྙེད་ཡོད་པ་བས།
en: “As numerous as are the names And aspirations of all beings,

source: །དེ་བས་མི་ཡི་དབང་པོ་ཡི།
en: A lord of humans has even more

source: །དབྱངས་ཀྱི་ཡན་ལག་བསྔགས་པ་མང་།
en: Qualities of the aspects of his speech. {7}

source: །སེམས་ཅན་ཀུན་གྱིས་མིང་ཡོད་པ།
en: “The names of all beings that have been taught

source: །དེ་དག་སེམས་ཅན་གཅིག་ལ་བསྟན།
en: To be those of one being

source: །སེམས་ཅན་གཅིག་མིང་ཇི་སྙེད་པ།
en: Are the names of one being

source: །སེམས་ཅན་ཀུན་གྱི་མིང་དུ་བསྟན། །སོ་སོ་ཡང་དག་རིག་འཇུག་པ།
en: That have been taught to be those of all beings. {8}

source: །འདི་ནི་སངས་རྒྱས་བསྟན་པ་སྟེ།
en: “The Buddha has taught

source: །བྱང་ཆུབ་སེམས་དཔའི་ཕྱིར་ཡང་ནི། །མིང་རྣམས་མཐའ་ཡས་ངེས་པར་བསྟན།
en: This engagement with discernment. Infinite names have been taught For the sake of the bodhisattvas. {9} “Those who wish to teach in some way

source: །མདོ་སྡེ་བྱེ་བ་བསམ་ཡས་རྣམས། །ཇི་ལྟར་བཤད་སྙམ་གང་སེམས་པ།
en: The endless millions of sūtras

source: །མདོ་སྡེ་འདི་ནི་རབ་བརྗོད་ལ།
en: Should recite this sūtra

source: །ཞུམ་པ་མེད་པར་བཤད་པར་གྱིས།
en: And teach it with full confidence. {10}

source: །འཁོར་གྱི་ནང་དུ་ཐོགས་མེད་པར།
en: “They should teach in the middle of an assembly

source: །མདོ་སྡེ་བྱེ་བ་རབ་ཏུ་འཆད། །ཇི་ལྟར་ནམ་མཁའ་མཐའ་མེད་པ།
en: Millions of sūtras without impediment.

source: །དེ་བཞིན་དེ་ལའང་ཆོས་རྣམས་སྟོན།
en: They should teach the Dharma in the way That space is without any limit. {11}

source: །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་དག །སེམས་ཅན་དག་པ་སྐྱོབ་པ་རྣམས།
en: “In that way the bodhisattvas, The pure beings, the protectors,

source: །མདོ་སྡེ་འདི་དག་བཟུང་ནས་ནི།
en: Having taken up this sūtra

source: །ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པར་འགྱུར།
en: Will become endowed with wisdom. {12} “Through the way this path is taught

source: །དད་པས་ཇི་ལྟ་ཇི་ལྟ་བུར། །ཚུལ་འདི་རབ་ཏུ་སྟོན་བྱེད་པ།
en: By those who have faith,

source: །དེ་བཞིན་དེ་ཡི་ཡེ་ཤེས་འཕེལ།
en: That is how wisdom grows,

source: །གངས་རི་ལ་ནི་སྡོང་པོ་བཞིན།
en: Like a tree on a snow mountain.” {13}

source: །དེ་བཞིན་གཤེགས་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་ལེའུ་སྟེ་ཉི་ཤུ་བཞི་པའོ།། །།འཕགས་པ་ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོའི་མདོ། བམ་པོ་བརྒྱད་པ།
en: Conclusion of the twenty-fourth chapter, “The Inconceivable Tathāgata.”

source: གཞོན་ནུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཇི་ལྟར་ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པ་ལ་སྤྱོད་ན་ཆོས་ལ་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་སྒྲུབ་པར་འགྱུར་ཞེ་ན།
en: Engaging in Discernment Chapter 25 “Young man, how do bodhisattva mahāsattvas who practice that discernment of phenomena, who view phenomena as phenomena, attain the highest, complete enlightenment?

source: གཞོན་ནུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་བས་གཟུགས་ལས་གཞན་དུ་བྱང་ཆུབ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་།
en: “Young man, bodhisattva mahāsattvas who practice that discernment of phenomena, who view phenomena as phenomena, do not perceive enlightenment as other than form.

source: གཟུགས་ལས་གཞན་དུ་ཡང་བྱང་ཆུབ་ལ་མི་སྤྱོད།
en: They do not approach enlightenment as other than form.

source: གཟུགས་ལས་གཞན་དུ་ཡང་བྱང་ཆུབ་ཡོངས་སུ་མི་ཚོལ།
en: They do not seek enlightenment as other than form.

source: གཟུགས་ལས་གཞན་དུ་ཡང་བྱང་ཆུབ་ཡང་དག་པར་མི་སྒྲུབ།
en: They do not attain enlightenment as other than form.

source: གཟུགས་ལས་གཞན་དུ་ཡང་སེམས་ཅན་རྣམས་བྱང་ཆུབ་ལ་ཡང་དག་པར་མི་འཛུད།
en: They do not inspire beings to an enlightenment that is other than form.

source: གཟུགས་ལས་གཞན་དུ་ཡང་དེ་བཞིན་གཤེགས་པ་མི་མཐོང་སྟེ།
en: They do not see a tathāgata as other than form. They see a tathāgata in this way:

source: གཟུགས་ཀྱི་མི་འཇིགས་པའི་ངོ་བོ་ཉིད་དེ་བཞིན་གཤེགས་པའོ་ཞེས་དེ་བཞིན་གཤེགས་པར་ལྟའོ། །གཟུགས་ཀྱང་གཞན་གཟུགས་ཀྱི་ངོ་བོ་ཉིད་ཀྱང་གཞན་ནོ་ཞེས་དེ་ལྟར་མི་ལྟའོ།
en: ‘The Tathāgata is the fearlessness that is the nature of form.’ They do not see the tathāgata as other than form, as other than the nature of form.

source: །གཟུགས་ཀྱི་ངོ་བོ་ཉིད་ཀྱང་གཞན་དེ་བཞིན་གཤེགས་པ་ཡང་གཞན་ནོ་ཞེས་དེ་ལྟར་ཡང་མི་ལྟའོ།
en: They do not see the nature of form as other than the tathāgata.

source: །གཟུགས་ཀྱིས་ངོ་བོ་ཉིད་གང་ཡིན་པ་དང་དེ་བཞིན་གཤེགས་པ་གང་ཡིན་པ་དེ་ནི་གཉིས་སུ་མེད་པའི་ཆོས་ཉིད་དེ།
en: The nature of that which is called form and that of the tathāgata are nondual.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་ལྟ་ན་ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པ་ལ་སྤྱོད་དོ།
en: The bodhisattva mahāsattvas who see in that way are engaging in the discernment of phenomena.

source: །དེ་བཞིན་དུ་ཚོར་བ་ལས་གཞན་དུ་མ་ཡིན། འདུ་ཤེས་ལས་གཞན་དུ་མ་ཡིན། འདུ་བྱེད་རྣམས་ལས་གཞན་དུ་མ་ཡིན་ཏེ། རྣམ་པར་ཤེས་པ་ལས་གཞན་དུ་བྱང་ཆུབ་མི་མཐོང་།
en: “In that same way they do not perceive enlightenment as other than sensation, other than identification, other than mentation, or other than consciousness.

source: རྣམ་པར་ཤེས་པ་ལས་གཞན་དུ་ཡང་བྱང་ཆུབ་ལ་མི་སྤྱོད།
en: They do not approach enlightenment as being other than consciousness.

source: རྣམ་པར་ཤེས་པ་ལས་གཞན་དུ་ཡང་བྱང་ཆུབ་ཡོངས་སུ་མི་ཚོལ།
en: They do not seek enlightenment as other than consciousness.

source: རྣམ་པར་ཤེས་པ་ལས་གཞན་དུ་ཡང་བྱང་ཆུབ་ཡང་དག་པར་མི་སྒྲུབ།
en: They do not attain enlightenment as other than consciousness.

source: རྣམ་པར་ཤེས་པ་ལས་གཞན་དུ་ཡང་སེམས་ཅན་རྣམས་བྱང་ཆུབ་ལ་ཡང་དག་པར་མི་འཛུད།
en: They do not inspire beings to an enlightenment that is other than consciousness.

source: རྣམ་པར་ཤེས་པ་ལས་གཞན་དུ་ཡང་དེ་བཞིན་གཤེགས་པ་མི་མཐོང་སྟེ།
en: They do not see a tathāgata as other than consciousness. They see a tathāgata in this way:

source: རྣམ་པར་ཤེས་པའི་མི་འཇིགས་པའི་ངོ་བོ་ཉིད་དེ་བཞིན་གཤེགས་པའོ་ཞེས་དེ་བཞིན་གཤེགས་པར་བལྟའོ། །རྣམ་པར་ཤེས་པ་ཡང་གཞན། རྣམ་པར་ཤེས་པའི་ངོ་བོ་ཉིད་ཀྱང་གཞན་ནོ་ཞེས་དེ་ལྟར་མི་ལྟའོ།
en: ‘The Tathāgata is the fearlessness that is the nature of consciousness.’ They do not see the tathāgata as other than consciousness, as other than the nature of consciousness.

source: །རྣམ་པར་ཤེས་པའི་ངོ་བོ་ཉིད་ཀྱང་གཞན་དེ་བཞིན་གཤེགས་པ་ཡང་གཞན་ནོ་ཞེས་དེ་ལྟར་ཡང་མི་ལྟའོ།
en: They do not see the nature of consciousness as other than the tathāgata.

source: །རྣམ་པར་ཤེས་པའི་ངོ་བོ་ཉིད་གང་ཡིན་པ་དང་། དེ་བཞིན་གཤེགས་པ་གང་ཡིན་པ་དེ་གཉིས་སུ་མེད་པའི་ཆོས་ཉིད་དེ།
en: The nature of that which is called consciousness and that of the tathāgata are nondual.

source: །གཟུགས་ཀྱིས་ཀྱང་ནི་བྱང་ཆུབ་བསྟན།
en: “Enlightenment is taught through form;

source: །བྱང་ཆུབ་ཀྱིས་ཀྱང་གཟུགས་བསྟན་ཏེ།
en: Form is taught through enlightenment.

source: །མི་མཚུངས་པ་ཡི་སྒྲ་རྣམས་ཀྱིས།
en: Through these dissimilar words

source: །ཆོས་ཀྱི་བླ་མ་རབ་ཏུ་བསྟན།
en: The highest of Dharma is taught. {1}

source: །སྒྲ་ཡིས་གཟུགས་ཀྱི་བླ་མ་སྟེ།
en: “The highest form is taught through words;

source: །ངོ་བོ་ཉིད་ཀྱིས་ཟབ་པ་དག །
en: Its nature is profound.

source: གཟུགས་དང་བྱང་ཆུབ་མཉམ་པ་སྟེ།
en: Form and enlightenment are the same:

source: །ཐ་དད་བྱ་བ་དེ་མི་རྙེད།
en: There is no difference that can be found. {2}

source: །མྱ་ངན་འདས་པ་ཟབ་པར་ཡང་།
en: “Nirvāṇa is profound

source: །སྒྲ་ཡིས་རབ་ཏུ་བསྟན་པ་ལྟར།
en: And it is taught through words,

source: །མྱ་ངན་འདས་པ་མི་རྙེད་དེ།
en: Yet nirvāṇa is not to be found

source: །དེ་ཡི་སྒྲ་ཡང་མི་རྙེད་དོ།
en: And words are not to be found. {3}

source: །སྒྲ་དང་མྱ་ངན་འདས་པ་ནི།
en: “Both words and nirvāṇa,

source: །གཉི་ག་རྙེད་པར་མི་འགྱུར་ཏེ།
en: Neither of them are to be found. Thus nirvāṇa has been taught

source: །དེ་བཞིན་སྟོང་པའི་ཆོས་རྣམས་ལ། །མྱ་ངན་འདས་པ་རབ་ཏུ་བསྟན། །མྱ་ངན་འདས་དང་འདའ་བར་ནི།
en: In terms of empty phenomena. {4}

source: །འདི་ནི་ཆོས་རྣམས་འཇུག་མེད་པ།
en: There is no development of phenomena.

source: །ཕྱིས་ནི་ཅི་འདྲ་དེ་བཞིན་སྔོན།
en: It is afterward just as it was before. {5}

source: །ཆོས་རྣམས་ཐམས་ཅད་རང་བཞིན་གྱིས།
en: “All phenomena are by nature

source: །མྱ་ངན་འདས་དང་མཚུངས་མཉམ་པར།
en: Exactly the same as nirvāṇa. That is known by those dedicated to renunciation,

source: །སངས་རྒྱས་བསྟན་ལ་བརྩོན་པ་ཡི། །འབྱུང་བ་ལྷུར་བྱེད་རྣམས་ཀྱིས་རིག །སངས་རྒྱས་ཀྱི་ནི་སྐུ་མཐོང་ནས།
en: By those engaged in the Buddha’s teachings. {6}

source: །འདྲེན་པ་མཐོང་ཞེས་སྨྲ་མོད་ཀྱི།
en: “Some say, ‘I have seen the Guide,

source: །ང་ནི་གཟུགས་ཀྱི་སྐུ་ལུས་སུ།
en: For I saw the Buddha’s body.’

source: །སུས་ཀྱང་བལྟ་བར་མི་ནུས་སོ།
en: But it is not possible for anyone To see me because of my rūpakāya. {7}

source: །གཟུགས་ཀྱི་མཚན་ཉིད་ཅི་འདྲ་བར།
en: “The known nature of form,

source: །གཟུགས་ཀྱི་ངོ་བོ་ཉིད་ཤེས་ཏེ།
en: That is the characteristic of form.

source: །གཟུགས་ཀྱི་ངོ་བོ་ཉིད་ཤེས་ན། །ང་ཡི་སྐུ་ཡང་ངེས་པར་བསྟན།
en: When the nature of form is known, Then my body is revealed. {8} “In that way I know the characteristics

source: །དེ་བཞིན་ཕུང་པོ་ལྔ་རྣམས་ཀྱི། །ཆོས་ཀྱི་མཚན་ཉིད་ངས་ཤེས་ཏེ།
en: Of phenomena, of the five skandhas.

source: །ཆོས་ཀྱི་རང་བཞིན་ཤེས་ནས་ནི། །ཆོས་ཀྱི་སྐུ་ལ་རབ་ཏུ་གནས།
en: Knowing that nature of phenomena,

source: །ཆོས་ཀྱི་སྐུ་ལ་རབ་གནས་ནས།
en: I remain in the dharmakāya. {9}

source: །སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏོ།
en: “I teach the Dharma to beings

source: །ཆོས་ཀྱི་སྐུ་ལ་མི་རྟེན་པར། །སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏོ།
en: Without departing from the dharmakāya.

source: །སངས་རྒྱས་དག་གི་ཆོས་རྣམས་ནི།
en: But the qualities of the buddhas

source: །ཚིག་གིས་བཤད་པར་མི་ནུས་ཏེ།
en: Cannot be expressed in words. {10}

source: །འདི་འདྲའི་ཚུལ་རྣམས་མི་ཤེས་པས།
en: “Those who do not know this way

source: །སངས་རྒྱས་ཀྱི་ནི་སྒྲ་ཐོས་ནས། །ཚིག་ཙམ་གྱིས་ནི་འདི་སྐད་སྨྲ།
en: Listen to the Buddha’s words And then merely say with words,

source: །ངས་ནི་འདྲེན་པ་མཐོང་ཞེས་ཏེ།
en: ‘I have seen the Guide of humans.’ {11}

source: །འདུ་ཤེས་ཐམས་ཅད་སྤངས་པ་ལ།
en: “Whoever casts off all conceptual identification

source: །སྲིད་པར་འདུ་ཤེས་མེད་པར་འགྱུར།
en: Brings to an end the identification of existence.

source: །སྒྲར་ནི་འདུ་ཤེས་འཛིན་པ་ལ།
en: Whoever has a conceptual identification of words

source: །ནམས་ཀྱང་སྟོན་པ་མཐོང་བ་མེད།
en: Will never be able to see the Teacher. {12} “Whoever knows emptiness

source: །འདི་ལྟ་བུ་ཡི་གཟུགས་ཀྱི་མཚན།
en: As the characteristic of form

source: །སྟོང་པ་ཉིད་ནི་སུས་ཤེས་པ།
en: Will not say that emptiness

source: །གཟུགས་ཀྱི་རང་བཞིན་གཞན་ཡིན་ལ། །སྟོང་ཉིད་གཞན་དུ་མ་གསུངས་ཏེ།
en: Is other than the nature of form.

source: །གང་གིས་གཟུགས་རྣམས་རབ་ཤེས་པ། །དེས་ནི་སྟོང་ཉིད་རབ་ཏུ་ཤེས། །གཟུགས་ཀྱི་མཚན་ཉིད་འདི་འདྲ་བར།
en: Whoever knows form, Knows emptiness. {13}

source: །སྟོང་པ་གང་གིས་རབ་ཤེས་པ།
en: “Whoever knows emptiness As the characteristic of form Will overcome and defeat

source: །དེས་ནི་བདུད་རྣམས་བྱེ་བ་སྙེད། །ཟིལ་གྱིས་མནན་ཏེ་ཕམ་བྱེད་ནུས།
en: Tens of millions of māras. {14}

source: །གང་གིས་གཟུགས་རྣམས་རབ་ཤེས་པ།
en: “Whoever knows form,

source: །དེས་ནི་སྟོང་པ་ཉིད་ཀྱང་ཤེས།
en: Knows emptiness.

source: །གང་གིས་སྟོང་ཉིད་རབ་ཤེས་པ།
en: Whoever knows emptiness,

source: །དེས་ནི་མྱ་ངན་འདས་པ་ཤེས།
en: Knows nirvāṇa. {15}

source: །རྣམ་པ་འདི་ནི་མི་ཤེས་པས།
en: “Those who do not know this way,

source: །དམིགས་པ་ཅན་རྣམས་རབ་ཏུ་བརླག །དངོས་པོ་མེད་ལ་དངོས་འཛིན་ཅིང་།
en: Those who conceptualize, are lost. They conceive of the unreal as being real

source: །དངོས་མེད་ལ་ཡང་དངོས་སུ་འཛིན།
en: And the real as being unreal. {16}

source: །ཤེས་ཀྱི་ཁེ་ཡིས་བསླུས་པ་དག །ང་ཡི་བསྟན་ལས་ཤིན་ཏུ་འཁྱམས།
en: “They are deceived by acquisitions through reputation And wander far from my teaching.

source: །འབྲས་བུར་འདུ་ཤེས་གནས་པ་ལ།
en: They maintain the conception of a result

source: །དགེ་སྦྱོང་ནོར་ནི་གསོག་ཏུ་གྱུར།
en: And lose all their wealth of mendicancy. {17}

source: །བརྩོན་འགྲུས་ཉམས་པ་ལེ་ལོ་ཅན།
en: “Those who are lazy and lacking in diligence,

source: །ཚུལ་ཁྲིམས་ཕུང་པོར་མི་གནས་པ།
en: Who do not maintain the aspect of conduct,

source: །ཀུན་ནས་ལངས་པས་སྨྲ་བ་ནི།
en: They will stand up and state,

source: །འདི་ནི་སངས་རྒྱས་བཤད་མ་ཡིན།
en: ‘That is not the teaching of the Buddha!’ {18}

source: །ལ་ལ་དག་ནི་འདི་སྐད་དུ།
en: “Some of them will declare,

source: །བདག་ཅག་བྱང་ཆུབ་ཞུགས་ཞེས་ཟེར།
en: ‘We are enlightened!’

source: །མ་དུལ་ཞིང་ནི་མ་བྱང་བ།
en: But they will be uncontrolled, untrained,

source: །གཅིག་ལ་གཅིག་ཀྱང་རི་མོ་མེད།
en: And disrespectful to each other. {19} “They will delight in words

source: །ཆོས་དག་ལ་ཡང་མི་གནས་ཤིང་། །སྒྲ་འདོད་པ་དག་འབྱུང་བར་འགྱུར།
en: And have no stability in the Dharma.

source: །དེ་ལྟ་བུ་ནི་དེ་མོས་ཏེ།
en: They will have that kind of aspiration,

source: །ཤེས་ཀྱི་ཁེ་ནི་ཚོལ་བའི་ཕྱིར།
en: Desiring what is gained through reputation. {20}

source: །འདུས་པ་དག་ལ་སེམས་བྱེད་ཅིང་།
en: “They will be motivated to have a following.

source: །རྙེད་པ་འདོད་པ་འབྱུང་བར་འགྱུར།
en: They will delight in acquisition.

source: །རྒྱགས་དང་བག་མེད་ཟིལ་ནོན་པས།
en: They will be overpowered by arrogance and carelessness.

source: །རྙེད་དང་བཀུར་སྟི་དོན་དུ་གཉེར།
en: Their goal will be gain and honors. {21}

source: །བཀུར་སྟི་རྙེད་ལ་བརྟེན་ནས་ནི།
en: “Based upon gains and honors

source: །ཤེས་ཀྱི་ཁེ་རྣམས་ཚོལ་བ་དག །གཙུག་ལག་ཁང་དང་མཆོད་རྟེན་བྱེད།
en: They will desire the intellect’s accomplishments. They will build temples and stūpas.

source: །ཁྱིམ་མི་མོ་ལ་ཆགས་ཤིང་མོས།
en: Their interest will be in the women of families. {22}

source: །དམིགས་པ་དག་ལ་རྟེན་བྱེད་ཅིང་།
en: “They will depend upon their perception.

source: །འདོད་པའི་སྲེད་ལ་ཤིན་ཏུ་གནས།
en: They will dwell in craving and desire.

source: །བདུད་ཀྱི་ཡུལ་དུ་གནས་ནས་ནི།
en: They will be within the realm of Māra

source: །ཁྱིམ་པ་དག་གི་ལས་བྱེད་འགྱུར།
en: And they will do the work of laypeople. {23}

source: །འདོད་པ་མེ་ལྕེ་འདྲ་བ་ནི།
en: “Their desire will be like the flames of a fire.

source: །ཁྱིམ་པ་དག་ལ་སྟོན་པར་འགྱུར།
en: They will give teachings to laypeople.

source: །དེ་དག་གི་ཡང་ཁྱིམ་ཞུགས་ནས།
en: They will enter into their homes

source: །དེ་ཡི་རིགས་ཀྱང་སུན་བྱེད་འགྱུར། །དེ་དག་ལ་ནི་ཁྱིམ་པ་རྣམས།
en: And they will corrupt those families. {24} “The laypeople will come to think of them

source: །སྟོན་པ་ཉིད་དུ་འདུ་ཤེས་འགྱུར།
en: As their teachers.

source: །རབ་ཏུ་གནས་བཅས་དེ་དག་གི།
en: They will take up residence with them

source: །བུ་དང་ཆུང་མ་སུན་པར་བྱེད།
en: And they will corrupt their sons and daughters. {25} “They will treat with kindness

source: །སུ་དག་དེ་ལ་ཟས་སྐོམ་གྱིས།
en: Those who give them food and drink,

source: །ཕན་འདོགས་པ་ནི་བྱེད་པར་འགྱུར།
en: And they will think of those people’s wives

source: །དེ་ཡི་བུ་མོ་བུད་མེད་ལ།
en: And daughters as their own wives. {26} “Laymen will not be as attracted

source: །ཆུང་མ་ཉིད་དུ་འདུ་ཤེས་འགྱུར།
en: To their own wives

source: །དེ་དག་འདིར་ནི་རབ་བྱུང་ནས། །ཇི་ལྟར་གཞན་གྱི་བུད་མེད་ཆགས། །ཁྱིམ་པ་བདག་གི་ཆུང་མ་ལ། །དེ་ལྟར་མོས་ཤིང་ཆགས་མི་འགྱུར། །ཁྱིམ་པ་སྐྱ་བོའི་གོས་གྱོན་ལ། །ངས་ནི་བསླབ་པ་གང་བཤད་པ།
en: As the mendicants will be Attracted to the wives of others. {27} “There are the trainings that I have taught To the laymen who wear white clothing.

source: །དེ་ཚེ་དགེ་སློང་དེ་དག་ལ།
en: At that time, those bhikṣus

source: །བསླབ་པ་དེ་ཡང་མེད་པར་འགྱུར།
en: Will not even have those trainings. {28}

source: །དེ་དག་རྔ་དུང་རྫ་རྔ་ཡིས། །ང་ལ་མཆོད་པ་བྱེད་འགྱུར་ཏེ།
en: “They will make offerings to me With bherī drums, conches, and mṛdaṅga drums.

source: །མཆོད་པའི་དམ་པ་གང་ཡིན་པ།
en: The offerings that are superior

source: །ནན་ཏན་འདི་ནི་མེད་པར་འགྱུར།
en: Will not be included in their practices. {29}

source: །དེ་དག་བདག་ཉིད་ཚུལ་ཁྲིམས་འཆལ།
en: “When they who have very poor conduct

source: །ཚུལ་ཁྲིམས་གནས་པ་མཐོང་ནས་ནི།
en: See those who are maintaining correct conduct

source: །ཕན་ཚུན་དུ་ཡང་འདི་སྐད་དུ།
en: They will say, one to another,

source: །འདི་དག་ངེད་དང་འདྲ་ཞེས་སྨྲ།
en: ‘They are the same as us.’ {30}

source: །སྡིག་པའི་སྤྱོད་ཡུལ་ཚུལ་ཁྲིམས་འཆལ།
en: “When those with bad conduct and wicked behavior

source: །དེ་དག་ཚུལ་ཁྲིམས་བསྔགས་ཐོས་ནས།
en: Hear correct conduct being praised,

source: །ཀུན་ནས་ལངས་པ་འདི་སྐད་དུ།
en: They will stand up and state,

source: །སངས་རྒྱས་མཁྱེན་པ་འདི་མིན་སྨྲ།
en: ‘That is not the Buddha’s teaching.’ {31}

source: །དེ་དག་ལ་ནི་ངོ་ཚ་མེད།
en: “They will be devoid of shame.

source: །དགེ་སྦྱོང་གི་ནི་ནོར་སྟོར་ཏེ།
en: They will have lost the wealth of the mendicant.

source: །མི་བདེན་ཚིག་གིས་རྩོད་བྱེད་ཅིང་།
en: They will debate with words that are false

source: །སངས་རྒྱས་བྱང་ཆུབ་རབ་ཏུ་སྤོང་།
en: And reject the enlightenment of buddhahood. {32}

source: །ངན་སེམས་ལྡན་པ་དེ་དག་ནི།
en: “They who have wicked minds

source: །སངས་རྒྱས་བསྟན་པ་འདི་བོར་ཏེ།
en: Will reject the Buddha’s teaching.

source: །ཆོས་རྣམས་རབ་ཏུ་སྤངས་ནས་ནི།
en: They will cast aside the Dharma

source: །མནར་མེད་པར་ཡང་གནས་པར་འགྱུར།
en: And they will dwell in the Avīci hell. {33}

source: །གང་དག་སྤྱོད་པ་དེ་འདྲ་བ།
en: “Those who have that kind of conduct

source: །ངས་ནི་མ་ཐོས་མ་མཐོང་སྟེ།
en: Will neither hear me nor see me.

source: །བྱིས་པའི་ཆོས་ལ་གནས་པ་རྣམས།
en: Those who follow the Dharma of fools

source: །སངས་རྒྱས་ཡེ་ཤེས་ཐོབ་མི་འགྱུར། །དེ་དག་གི་ཡང་ཚུལ་འཆོས་དང་། །དེ་ལ་གཡོ་ཡང་ཅི་ཡོད་པ།
en: Will not attain the wisdom of buddhahood. {34} “They will be hypocrites Who will deceive by saying,

source: །ཐམས་ཅད་དེ་བཞིན་ངས་ཤེས་ཏེ།
en: ‘I know everything about that.

source: །དེ་ལ་ང་ཡི་ཡེ་ཤེས་འཇུག །དེ་ཡི་འཁྲུལ་པ་མང་པོ་ནི། །གལ་ཏེ་བསྐལ་པར་རབ་བཤད་ཀྱང་།
en: That wisdom is within me.’ {35} “If I were to teach them for an eon Their confusion would still be vast. They do no more than make

source: །བྱང་ཆུབ་སེམས་དཔར་ཁས་འཆེ་ཡི། །ཅུང་ཟད་ཙམ་ཞིག་བརྗོད་པར་འགྱུར།
en: Promises to be bodhisattvas. {36}

source: །གཞོན་ནུར་གྱུར་པ་དེ་དག་ནི།
en: “They will be young men

source: །སྡིག་པ་མི་བྱེད་ཡོང་མེད་དེ།
en: Whose bad behavior is incessant.
